{
  "title": "cream of broccoli soup",
  "slug": "cream-of-broccoli-soup",
  "servings": "4-6",
  "tags": [
    "Soup"
  ],
  "ingredients": [
    {
      "ingredient": "Splash of oil"
    },
    {
      "ingredient": "1/2 a leek"
    },
    {
      "ingredient": "1 carrot"
    },
    {
      "ingredient": "1 stick of celery"
    },
    {
      "ingredient": "1 teaspoon of garlic"
    },
    {
      "ingredient": "1/4 teaspoon chili flakes"
    },
    {
      "ingredient": "1/2 teaspoon dried thyme"
    },
    {
      "ingredient": "1 bay leaf"
    },
    {
      "ingredient": "1 head of broccoli"
    },
    {
      "ingredient": "1 medium potato"
    },
    {
      "ingredient": "1 - 1.5 litres vegetable stock",
      "context": "Start with a litre and add more if needed when blending"
    },
    {
      "ingredient": "Nutritional yeast",
      "context": "Either sprinkle on top when serving or mix up to 1 cup in when blending the soup"
    }
  ],
  "ingredientGroups": [
    {
      "groupTitle": "Cashew cream",
      "ingredients": [
        {
          "ingredient": "1/2 cup cashews"
        },
        {
          "ingredient": "1/2 cup water"
        },
        {
          "ingredient": "1 1/2 tablespoons lemon juice"
        }
      ]
    }
  ],
  "steps": [
    {
      "step": "Slice leek. Heat oil in a soup pot on a medium heat. Cook down leek."
    },
    {
      "step": "Meanwhile dice your carrot, celery, potato and broccoli (including the stalks!) and set aside."
    },
    {
      "step": "Add the carrot and celery to the pot with the leek and cook for around five minutes until softened. Next add in minced garlic, thyme and chili flakes and fry for a few more minutes.\n"
    },
    {
      "step": "In a small pot add the cashews and cover with water. Bring to the boil then reduce to a simmer. Simmer for at least 10 minutes.\n"
    },
    {
      "step": "Meanwhile add the potato and broccoli to the soup pot. Stir. Add vegetable stock and bay leaf to the pot and bring to a boil. Turn down to a simmer and cook for 15-20 minutes until the potato is soft. \n"
    },
    {
      "step": "While the soup is simmering, blend cashews (drain the cooking water first), lemon juice and ½ cup of water, until completely smooth and creamy. \n"
    },
    {
      "step": "Remove the soup from the heat, remove bay leaf, add the cashew cream and blend with an immersion blender (alternatively blend in batches in a blender). \n"
    },
    {
      "step": "Either mix nutritional yeast into the soup now or sprinkle some on top when serving."
    },
    {
      "step": "Season with salt, pepper and nutritional yeast to your taste. \nEnjoy with a crusty chunk of bread!"
    }
  ]
}