{
  "title": "spiced oatmeal cookies",
  "slug": "spiced-oatmeal-cookies",
  "servings": "24",
  "tags": [
    "Baking"
  ],
  "image": "/images/cookies.svg",
  "ingredients": [
    {
      "ingredient": "113g butter, softened "
    },
    {
      "ingredient": "½ cup packed brown sugar "
    },
    {
      "ingredient": "2 tablespoons sugar "
    },
    {
      "ingredient": "1 large egg "
    },
    {
      "ingredient": "1 ½ teaspoons vanilla essence "
    },
    {
      "ingredient": "2 teaspoons cinnamon "
    },
    {
      "ingredient": "1 teaspoon ground nutmeg "
    },
    {
      "ingredient": "½ teaspoon baking soda"
    },
    {
      "ingredient": " ¼ teaspoon baking powder "
    },
    {
      "ingredient": "¼ teaspoon salt "
    },
    {
      "ingredient": "1 ¾ cup rolled oats "
    },
    {
      "ingredient": "⅔ cup plain flour "
    },
    {
      "ingredient": "Optional add in - such as chocolate chips, or raisins",
      "context": "(Add as much as feels right)"
    }
  ],
  "steps": [
    {
      "step": "Preheat the oven to 160 degrees C. Line two cookie sheets with parchment paper, or lightly grease them."
    },
    {
      "step": "In a medium mixing bowl, combine the butter, brown sugar and sugar. Beat them together until they are fully incorporated and lighter in color."
    },
    {
      "step": "Add the egg and vanilla and beat well, until the mixture is light and fluffy. Add the cinnamon, nutmeg, baking soda, baking powder and salt, and blend until combined."
    },
    {
      "step": "Lastly, add the oats and flour and mix together. Scrape the sides and bottom of the bowl with a spatula, and make sure it’s evenly blended. Add add ins if using and mix through."
    },
    {
      "step": "With a cookie dough scoop or two spoons, scoop about 1 tablespoon of dough at a time onto the prepared baking sheets, leaving at least 2 inches of space around each cookie."
    },
    {
      "step": "Bake the cookies for 12 to 13 minutes, until they’re a light golden brown with slightly darker edges. Their middles may still look a tiny bit shiny; that’s OK, they’ll continue to bake as they cool on the pan."
    },
    {
      "step": "Remove the cookies from the oven, place the pan on a cooling rack, and let the cookies cool completely on the pan before handling (these cookies are delicate when warm).\nRepeat with any remaining cookies."
    }
  ]
}